import styles from "./AboutUs.module.css";

/**
 * Компонент AboutUs представляет собой блок с информацией о компании.
 */
const AboutUs = (): JSX.Element => {
  return (
    <div className={styles.wrapper}>
      <h1 className={styles.head}>О компании</h1>

      <div className={styles.wrapperText}>
        <p className={styles.paragraph}>
          <strong className={styles.strong}>
            Интернет-магазин "Sheva" – лучшие товары по низким ценам!
          </strong>
        </p>

        <p className={styles.paragraph}>
          Мы рады предложить вам недорогие, но качественные товары с подробными
          описаниями, характеристиками и фотографиями. У нас Вы можете купить
          замечательные товары: технику, электронику, одежду, обувь, игрушки,
          книги и многое другое в вашем регионе по ценам производителей и без
          наценки.
        </p>

        <p className={styles.paragraph}>
          Продажа большого ассортимента разнообразных товаров – основная
          специализация нашего интернет-магазина. Мы доставим ваш заказ
          бесплатно в любой уголок мира, осуществим подробную консультацию по
          товарам и поможем с выбором.
        </p>

        <p className={styles.paragraph}>
          Магазин "Sheva" предлагает Вам купить качественную и доступную
          технику, электронику, одежду, обувь, игрушки, книги и многое другое с
          доставкой! Все виды современных товаров от эконом класса до более
          дорогих представлены в нашем каталоге.
        </p>

        <p className={styles.paragraph}>
          Вы можете купить любые товары в вашем городе: технику, электронику,
          одежду, обувь, игрушки, книги и многое другое.
        </p>

        <p className={styles.paragraph}>
          <strong>Наши главные преимущества:</strong>
        </p>

        <ul>
          <li>Низкие цены от производителей</li>

          <li>Доставка по городу в день заказа</li>

          <li>Доставка заказов Почтой по всей Стране за 5-15 дней</li>

          <li>Только оригинальная и сертифицированная продукция</li>

          <li>Гарантия на все товары – 5 лет!</li>

          <li>
            Не понравился товар? Вернем или обменяем в течение 14-ти дней без
            оформления лишних бумаг!
          </li>
          <li>Бонусы и скидки для постоянных покупателей</li>
        </ul>
      </div>
    </div>
  );
};

export default AboutUs;
